Revit 2027 API
BuiltInFailures.AutoRouteFailures.FamilySymbolNestingElementsError Property
 The fitting family contains unsupported nested elements or sub-elements. Please update the routing preference by selecting a different fitting type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilySymbolNestingElementsError { get; }
Public Shared ReadOnly Property FamilySymbolNestingElementsError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilySymbolNestingElementsError {
	FailureDefinitionId^ get ();
}
static member FamilySymbolNestingElementsError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace